# Splitting the datasets in train and test

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df1 = sns.load_dataset("titanic")
df1.shape

(891, 15)

In [6]:
df1 = sns.load_dataset("titanic")
df1.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [8]:
df1 = sns.load_dataset("titanic")
df1.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [9]:
df2=df1[['survived',"pclass",'age',"parch"]]
df3=df2.fillna(df2.mean())
df3

     survived  pclass        age  parch
0           0       3  22.000000      0
1           1       1  38.000000      0
2           1       3  26.000000      0
3           1       1  35.000000      0
4           0       3  35.000000      0
..        ...     ...        ...    ...
886         0       2  27.000000      0
887         1       1  19.000000      0
888         0       3  29.699118      2
889         1       1  26.000000      0
890         0       3  32.000000      0

[891 rows x 4 columns]

In [10]:
X= df3.drop("survived", axis=1)
y= df3["survived"]

print('shape of X = ', X.shape)
print('shape of y = ', y.shape)

shape of X =  (891, 3)
shape of y =  (891,)

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
X_train,X_test,y_train,y_test= train_test_split(X,y,test_size=0.3)

print('shape of X_train = ', X_train.shape)
print('shape of y_train = ', y_train.shape)
print('shape of X_test = ', X_test.shape)
print('shape of y_test = ', y_test.shape)

shape of X_train =  (623, 3)
shape of y_train =  (623,)
shape of X_test =  (268, 3)
shape of y_test =  (268,)

In [17]:
X_train.head(2)

     pclass   age  parch
594       2  37.0      0
885       3  39.0      5

In [18]:
y_test.head(2)

88     1
236    0
Name: survived, dtype: int64